Tekla.Structures.Model.UI.TemporaryTransparency
The possible temporary transparencies. Used to temporarily change transparency
of a model object to visualize some state in the model.

Tekla.Structures.Model.UI.TemporaryTransparency.HIDDEN
Object is hidden.

Tekla.Structures.Model.UI.TemporaryTransparency.TRANSPARENT
Object is transparent.

Tekla.Structures.Model.UI.TemporaryTransparency.SEMITRANSPARENT
Object is semi transparent.

Tekla.Structures.Model.UI.TemporaryTransparency.SEMIVISIBLE
Object is almost fully visible.

Tekla.Structures.Model.UI.TemporaryTransparency.VISIBLE
Object is fully visible.